import {memo} from "react";
import Button from "../ui/Button";

function Footer() {
  return (
    <footer className="mt-20">
      <div className="container flex flex-col lg:flex-row justify-center items-center">
        <div className="right-section w-full lg:w-1/2 flex flex-col">
          <div className="row singo-learn flex flex-col md:flex-row md:items-center lg:items-center lg:flex-row mb-6 align-middle">
            <Button to="/" classes="mb-2 lg:mb-0">
              <img
                src="../../public/images/logo.jpg"
                className="w-[130px]  h-[100px]"
                alt="singo learn"
              />
            </Button>

            <div className="texts">
              <h3 className="text-[#616161] text-xl -mt-3 lg:mt-0 mb-3">
                آکادمی سینگو لرن
              </h3>
              <p className="text-[#616161]">
                آموزش برنامه نویسی | پروژه محور | پشتیبانی دائمی | جامع
              </p>
            </div>
          </div>

          <div className="row description">
            <p>
              هدف سینگو لرن ارائه بهترین دوره های آموزش برنامه نویسی به
              دانشجویان برای ورود به بازار کار است و برای رسیدن به این هدف یک
              سری استانداردها تعیین شده و به صورت سختگیرانه روی دوره ها اعمال
              میشود. این استاندار ها شامل تدریس سلیس و روان برای انتقال مفاهیم
              در کنار کامل و جامع بودن دوره ها است به صورتی که با دیدن یک دوره
              به سطح مناسب و حرفه ای برسید. همچنین دوره ها پروژه محور هستند تا
              کاربرد مفاهیمی که یاد میگیرید را درک کنید و اگر احیانا ابهامی پیش
              آید میتوانید از پشتیبانی دائمی‌ سینگو لرن استفاده کنید و سوال
              هایتان را بپرسید. و در آخر به یکی از مهم ترین ویژگی دوره ها اشاره
              میکنم و آن هم آپدیت و بروز بودن آن ها مطابق آخرین تکنولوژی ها
              میباشد.
            </p>
          </div>
        </div>

        <div className="left-section w-full lg:w-1/2 flex flex-col items-center">
          <div className="row site-sections flex flex-col mt-5 w-full lg:w-1/2">
            <p className="text-[#616161] text-xl mb-5">بخش های سایت</p>
            <ul className="flex flex-col">
              <li className="flex items-center my-2 lg:m-0">
                <div className="w-2 h-2 bg-[#aaa]"></div>
                <Button to="/courses">دوره ها</Button>
              </li>

              <li className="flex items-center my-2 lg:m-0">
                <div className="w-2 h-2 bg-[#aaa]"></div>
                <Button to="/about-us">درباره ما</Button>
              </li>

              <li className="flex items-center my-2 lg:m-0">
                <div className="w-2 h-2 bg-[#aaa]"></div>
                <Button to="/students-comments">نظرات دانشجویان</Button>
              </li>
            </ul>
          </div>

          <div className="row social-medias flex my-8">
            <Button classes="mx-2 lg:mx-0 instagram text-[var(--dark-purple)]">
              <svg
                width="24px"
                height="24px"
                viewBox="0 0 24 24"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
              >
                <title fill="#7c3aed">Instagram icon</title>
                <path
                  d="M12 0C8.74 0 8.333.015 7.053.072 5.775.132 4.905.333 4.14.63c-.789.306-1.459.717-2.126 1.384S.935 3.35.63 4.14C.333 4.905.131 5.775.072 7.053.012 8.333 0 8.74 0 12s.015 3.667.072 4.947c.06 1.277.261 2.148.558 2.913.306.788.717 1.459 1.384 2.126.667.666 1.336 1.079 2.126 1.384.766.296 1.636.499 2.913.558C8.333 23.988 8.74 24 12 24s3.667-.015 4.947-.072c1.277-.06 2.148-.262 2.913-.558.788-.306 1.459-.718 2.126-1.384.666-.667 1.079-1.335 1.384-2.126.296-.765.499-1.636.558-2.913.06-1.28.072-1.687.072-4.947s-.015-3.667-.072-4.947c-.06-1.277-.262-2.149-.558-2.913-.306-.789-.718-1.459-1.384-2.126C21.319 1.347 20.651.935 19.86.63c-.765-.297-1.636-.499-2.913-.558C15.667.012 15.26 0 12 0zm0 2.16c3.203 0 3.585.016 4.85.071 1.17.055 1.805.249 2.227.415.562.217.96.477 1.382.896.419.42.679.819.896 1.381.164.422.36 1.057.413 2.227.057 1.266.07 1.646.07 4.85s-.015 3.585-.074 4.85c-.061 1.17-.256 1.805-.421 2.227-.224.562-.479.96-.899 1.382-.419.419-.824.679-1.38.896-.42.164-1.065.36-2.235.413-1.274.057-1.649.07-4.859.07-3.211 0-3.586-.015-4.859-.074-1.171-.061-1.816-.256-2.236-.421-.569-.224-.96-.479-1.379-.899-.421-.419-.69-.824-.9-1.38-.165-.42-.359-1.065-.42-2.235-.045-1.26-.061-1.649-.061-4.844 0-3.196.016-3.586.061-4.861.061-1.17.255-1.814.42-2.234.21-.57.479-.96.9-1.381.419-.419.81-.689 1.379-.898.42-.166 1.051-.361 2.221-.421 1.275-.045 1.65-.06 4.859-.06l.045.03zm0 3.678c-3.405 0-6.162 2.76-6.162 6.162 0 3.405 2.76 6.162 6.162 6.162 3.405 0 6.162-2.76 6.162-6.162 0-3.405-2.76-6.162-6.162-6.162zM12 16c-2.21 0-4-1.79-4-4s1.79-4 4-4 4 1.79 4 4-1.79 4-4 4zm7.846-10.405c0 .795-.646 1.44-1.44 1.44-.795 0-1.44-.646-1.44-1.44 0-.794.646-1.439 1.44-1.439.793-.001 1.44.645 1.44 1.439z"
                  fill="#7c3aed"
                ></path>
              </svg>
            </Button>

            <Button classes="mx-2 lg:mx-0 telegram">
              <svg
                fill="#000000"
                width="24px"
                height="24px"
                viewBox="0 0 32 32"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M29.919 6.163l-4.225 19.925c-0.319 1.406-1.15 1.756-2.331 1.094l-6.438-4.744-3.106 2.988c-0.344 0.344-0.631 0.631-1.294 0.631l0.463-6.556 11.931-10.781c0.519-0.462-0.113-0.719-0.806-0.256l-14.75 9.288-6.35-1.988c-1.381-0.431-1.406-1.381 0.288-2.044l24.837-9.569c1.15-0.431 2.156 0.256 1.781 2.013z"
                  fill="#7c3aed"
                ></path>
              </svg>
            </Button>

            <Button classes="mx-2 lg:mx-0 github">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 24 24"
                width="24"
                height="24"
                className="fill-[var(--dark-purple)]"
              >
                <path d="M12 1C5.923 1 1 5.923 1 12c0 4.867 3.149 8.979 7.521 10.436.55.096.756-.233.756-.522 0-.262-.013-1.128-.013-2.049-2.764.509-3.479-.674-3.699-1.292-.124-.317-.66-1.293-1.127-1.554-.385-.207-.936-.715-.014-.729.866-.014 1.485.797 1.691 1.128.99 1.663 2.571 1.196 3.204.907.096-.715.385-1.196.701-1.471-2.448-.275-5.005-1.224-5.005-5.432 0-1.196.426-2.186 1.128-2.956-.111-.275-.496-1.402.11-2.915 0 0 .921-.288 3.024 1.128a10.193 10.193 0 0 1 2.75-.371c.936 0 1.871.123 2.75.371 2.104-1.43 3.025-1.128 3.025-1.128.605 1.513.221 2.64.111 2.915.701.77 1.127 1.747 1.127 2.956 0 4.222-2.571 5.157-5.019 5.432.399.344.743 1.004.743 2.035 0 1.471-.014 2.654-.014 3.025 0 .289.206.632.756.522C19.851 20.979 23 16.854 23 12c0-6.077-4.922-11-11-11Z"></path>
              </svg>
            </Button>
          </div>
        </div>
      </div>

      <div className="owners mb-4 lg:mt-4">
        <p className="text-center">
          ساخته شده توسط{" "}
          <Button to="https://github.com/amirhosein7590" target='_blank' classes="text-[var(--dark-purple)]">
            امیرحسین
          </Button>
        </p>
      </div>
    </footer>
  );
}

export default memo(Footer);
