import { useEffect } from "react";
import StdCommentItems from "../components/sections/stdCommentItems";

function StudentsComments() {
  const stdComments = [
    {
      id: 1,
      name: "سارا رحیمی",
      courses: "دانشجوی HTML&CSS و جاوااسکریپت",
      opinion:
        "من دوره HTML&CSS و جاوااسکریپت استاد رو تهیه کردم و به نظرم علاوه بر اینکه خیلی ساده و قابل فهم توضیح دادن، پشتیبانی خیلی خوب و قوی داره، ینی هر وقت که سوالی برامون پیش بیاد میتونیم بپرسیم و در کمترین زمان ممکن جواب رو میگیریم",
    },
    {
      id: 2,
      name: "کیان بابان(ساکن کانادا)",
      courses: "دانشجوی جاوااسکریپت و ریکت",
      opinion:
        "من در دوره های HTML&CSS و جاوااسکریپت و ریکت سایت سینگو لرن شرکت کردم و تونستم تو کمتر از چهار ماه بدون هیچ پیشینه‌ای در زمینه فرانت اند به تسلط خوبی برسم.",
    },
    {
      id: 3,
      name: "مهدی احسانی",
      courses: "دانشجوی جاوااسکریپت و ریکت",
      opinion:
        "این دوره قطعا یکی از بهترین دوره هایی بود که من تا الان دیده بودم و همه چی داخلش توضیح داده شده و یکی از امکانات خوبی که این دوره داره اینه که پشتیبانی آنلاین داره و میتونیم هر سوالی راجب هر مبحثی رو بپرسیم.",
    },
    {
      id: 4,
      name: "سمیرا فرخ نژاد(ساکن استرالیا)",
      courses: "دانشجوی جاوااسکریپت و ریکت",
      opinion:
        "من سه ماه پیش دوره های ریکت و جاوااسکریپت سایت سینگو لرن رو شرکت کردم، پشتیبانی دوره واقعا عالی بود. از لحظه به لحظه دوره لذت بردم و الانم منجر به کار پیدا کردن من شد.",
    },
    {
      id: 5,
      name: "کسری اخوان",
      courses: "دانشجوی ریکت و گیت",
      opinion:
        "ریکت این سایت حرف نداره، صفر تا صد کارو خیلی سلیس و روون توضیح داده. در مورد پشتیبانی هم اینکه هر وقت پیام بدین تو کوتاه ترین زمان ممکن جوابتون رو میده.",
    },
    {
      id: 6,
      name: "ساغر ابازری(ساکن انگلیس)",
      courses: "دانشجوی HTML&CSS و جاوااسکریپت",
      opinion:
        "سلام، من ۳۲ سالمه، ایران زندگی نمیکنم، من HTML&CSSرو از ماش همدانی یاد گرفتم اما ترجیح دادم جاوااسکریپت رو به زبان فارسی یاد بگیرم و بعد از کلی تحقیق تو دوره های این سایت ثبت نام کردم و از نحوه تدریس و پشتیبانی خیلی راضیم.",
    },
    {
      id: 7,
      name: "سورنا گنجی",
      courses: "دانشجوی جاوااسکریپت و ریکت",
      opinion:
        "این دوره، اولین انتخاب من نبود ولی وقتی بقیه دوره هارو رصد کردم دیدم مثل این دوره تو دوره های فارسی اصلا نیست. مباحث خیلی کامل و جامع گفته شده و پشتیبانی خیلی خوبی داره.یکی از خوبی ها استاد اینه که مباحث پیچیده رو خیلی ساده توضیح میدن و تو مراحل مصاحبه هم همراهم بودن.",
    },
    {
      id: 8,
      name: "محمد عطایی",
      courses: "دانشجوی جاوااسکریپت و ریکت",
      opinion:
        "من از دانشجو های سایت سینگو لرن هستم، از قدرت بیان مدرسین، تدریس رونشون و پشتیبانیشون خیلی راضی هستم.",
    },
    {
      id: 9,
      name: "ابوالفضل اکبرزاده",
      courses: "دانشجوی HTML&CSS و جاوااسکریپت",
      opinion:
        "من تو دوره های سینگو لرن شرکت کردم و این یکی از بهترین انتخاب هایی بود که من تو زمینه برنامه نویسی داشتم چون من تو دوره های دیگه هم شرکت کردم و توی تون دوره ها علاوه بر اینکه مباحث به صورت دقیق توضیح داده نمیشه، پشتیبانی خوبی هم نداشتند اما این دوره همه این نکات رو داره.",
    },
    {
      id: 10,
      name: "امیر علی امانی پور",
      courses: "دانشجوی جاوااسکریپت",
      opinion:
        "من دانشجوی دوره جاوااسکریپت این سایت هستم، خواستم بگم که دوره شون خیلی خوب داره پیش میره و جدای از دوره خوبشون، پشتیبانیشون خیلی خوبه که در اسرع وقت به سوالات پاسخ کامل داده میشه.",
    },
  ];

  useEffect(() => {
    document.title = "نظرات دانشجویان";
  }, []);

  return (
    <main className="flex flex-col">
      {stdComments.map(std => (
        <StdCommentItems key={std.id} {...std} />
      ))}
    </main>
  )
}

export default StudentsComments;
